public class FunctionTest {

	//Function은 main 밖에 공간에 작성
	// void 뒤에 함수명
	// public static void : 누구나 가져가서 사용해라~!
	
public static void 숫자출력() {
	// 1~100까지 출력하는 while문 만드시오!
	int start = 1;

	// 조건 참이면 실행!
	while(start <= 10) {
	System.out.println("현재는:" + start);
	start += 1; // 다음으로 이동!
	}
}
///////////////////////////////////////////////////////////////////////////////////////////////////////	
public static void 숫자출력2() {
	// 1~100까지 출력하는 while문 만드시오!
	int start2 = 1;

	// 조건 참이면 실행!
	while(start2 <= 10) {
	System.out.println("현재는:"+ start2);
	start2 += 1; // 다음으로 이동!
	}
}
///////////////////////////////////////////////////////////////////////////////////////////////////////	
public static void name() {
	
}
///////////////////////////////////////////////////////////////////////////////////////////////////////	

///////////////////////////////////////////////////////////////////////////////////////////////////////	

///////////////////////////////////////////////////////////////////////////////////////////////////////	

///////////////////////////////////////////////////////////////////////////////////////////////////////	

///////////////////////////////////////////////////////////////////////////////////////////////////////	

///////////////////////////////////////////////////////////////////////////////////////////////////////	

		public static void main(String[] args) {
			
		System.out.println();
		// 1~10까지 출력하는 반복문 while
		// 시작값
		int start = 1;
		
		// 조건 참이면 실행!
		while(start <= 10) {
		System.out.println("현재는:" + start);
		start += 1; // 다음으로 이동!
		}
		System.out.println();
		// 1~100까지 출력하는 while문 만드시오!
		
		숫자출력2();
		
		//int start2 = 1;
		//
		//// 조건 참이면 실행!
		//while(start2 <= 10) {
		//System.out.println("현재는:"+ start2);
		//start2 += 1; // 다음으로 이동!
		//}
		System.out.println();
		// -6~6까지 출력하는 반복문 만드시오!
		int start3 = -6;
		
		// 조건 참이면 실행!
		while(start3 <= 6) {
		System.out.println("현재는:" +start3);
		start3 += 1; // 다음으로 이동!
		}
		
		// 1~100까지 반복하면서 홀수의 합과 짝수의 합을 구하시오!
		// 1 3 5 7 9 .....
		// 2 4 6 8 10 .....
		int start4 =1;
		int 홀수의합 = 0;
		int 짝수의합 = 0;
		
		while(start4 <= 6) {
		
		if(start4 % 2 == 0) {
		짝수의합 += start4;
		}else {
		홀수의합 += start4;
		}
		start4 += 1; // 다음으로 이동! 
		}
		// 1~10까지 출력하는 반복문 
		int start5 = 1;
		
		// 조건 참이면 실행!
		while(start5 <= 10) {
		System.out.println("현재는:" + start5);
		start5 += 1; // 다음으로 이동!
		}
		
		// 1~ 100까지 홀수의 합 짝수합 구하시오!
		int start6 =1;
		int 홀수의합2 = 0;
		int 짝수의합2 = 0;
		
		while(start6 <= 6) {
		
		if(start6 % 2 == 0) {
		짝수의합2 += start6;
		}else {
		홀수의합2 += start6;
		}
		start6 += 1; // 다음으로 이동! 
		}
		
		// 1~100까지 출력하는 반복문만드시오!
		// 위에서 작성했던 코드들이 아래쪽에 똑같이 사용이 될 수있어요!
		// 코드를 수정할때 (추가, 삭제, 수정) 일일 하나씩 다 찾아가야된다.
		
		// 함수(Function)
		//   - 긴~ 코드들을 한 단어로 바꾼다.!


}
}