
public class LoopEx2 {

	public static void main(String[] args) {
		// 로켓발사 카운트 다운 / 5->1 / 발사 ~

//		시작값
		int count1 = 5;
//		반복문
		while (count1 > 0) {
			System.out.println("로켓발사 카운트 다운: " + count1-- + " !");
		}
		System.out.println("발사!!!");

///////////////////////////////////////////////////////////////////////	
		System.out.println();
///////////////////////////////////////////////////////////////////////		
//		구구단

//		시작값 2?
		int count2 = 1;

//		구구단 2 시작
		while (count2 < 10) { // conut2 != 10 ?
			System.out.println("구구단을 외자 : " + "2 * " + count2 + " ? = " + +2 * (count2++));
		}
		System.out.println("잘했어요~");

///////////////////////////////////////////////////////////////////////
		System.out.println();
///////////////////////////////////////////////////////////////////////	
//		엘리베이터 로직

		int level = 1;
		int button = 15;

//		while(level )

///////////////////////////////////////////////////////////////////////
		System.out.println();
///////////////////////////////////////////////////////////////////////	

		int 번호 = 1;

		while (번호 != 20) {
			System.out.println(번호 + "학생");
			번호 += 3;
		}

	}

}
